Table of Contents
 Class CssComponent
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
One component of cross-section
[OpenModelClass("CI.StructModel.Libraries.CrossSection.CssComponent,CI.CrossSection")]
public class CssComponent : OpenObject
Inheritance
object
OpenObject
CssComponent
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Geometry
Geometry
public Region2D Geometry { get; set; }
Property Value
Region2D
 Id
Component Id
public int Id { get; set; }
Property Value
int
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 Phase
Phase
public int Phase { get; set; }
Property Value
int
 Edit this page